Description: Downloads latest Google Drive disk image. Note Google Drive File Stream was rebranded to Google Drive for desktop, and this recipe updated to reflect the name change.
Identifier: com.mhrono.recipes.download.GoogleDrive
MinimumVersion: '2.3'

Input:
  NAME: GoogleDrive
  DOWNLOAD_URL: https://dl.google.com/drive-file-stream/GoogleDrive.dmg

Process:
- Processor: URLDownloaderPython
  Arguments:
    filename: '%NAME%.dmg'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Google LLC (EQHXZ8M8AV)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%/GoogleDrive.pkg'
