Description: Downloads the latest Microsoft Teams installer pkg.
Identifier: com.mhrono.recipes.download.microsoftteams
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Teams
  VENDOR: Microsoft
  SOFTWARETITLE: Teams
  PRODUCTID: '869428'
  DOWNLOADURL: https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%

Process:
- Processor: URLDownloaderPython
  Arguments:
    filename: '%VENDOR%_%SOFTWARETITLE%.pkg'
    url: '%DOWNLOADURL%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Microsoft Corporation (UBF8T346G9)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
