Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Zeplin.
Identifier: com.mhrono.recipes.download.Zeplin
MinimumVersion: '2.3'

Input:
  NAME: Zeplin

Process:
- Processor: URLDownloaderPython
  Arguments:
    filename: '%NAME%.zip'
    url: https://zpl.io/download-mac

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Zeplin.app'
    requirement: anchor apple generic and identifier "io.zeplin.osx" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8U3Y4X5WDQ")
