Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Zeplin and creates a package.
Identifier: com.mhrono.recipes.pkg.Zeplin
ParentRecipe: com.mhrono.recipes.download.Zeplin
MinimumVersion: '2.3'

Input:
  NAME: Zeplin

Process:

- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/Zeplin.app'

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/Zeplin.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString