Description: Downloads both Arm and Intel verions of the Postman App
Identifier: com.mhrono.recipes.download.Postman-Universal
MinimumVersion: '2.3'

Input:
  NAME: Postman
  URL_ARM64: https://dl.pstmn.io/download/latest/osx_arm64
  URL_X86_64: https://dl.pstmn.io/download/latest/osx_64

Process:
  - Processor: URLDownloaderPython
    Arguments:
      filename: '%NAME%-arm64.zip'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_ARM64%'

  - Processor: URLDownloaderPython
    Arguments:
      filename: '%NAME%-x86_64.zip'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_X86_64%'

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%-arm64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/arm64'
      purge_destination: true

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%-x86_64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/x86_64'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/arm64/Postman.app'
      requirement: identifier "com.postmanlabs.mac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = H7H8Q7M5CK
      deep_verification: True
      strict_verification: True

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/Postman.app'
      requirement: identifier "com.postmanlabs.mac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = H7H8Q7M5CK
      deep_verification: True
      strict_verification: True

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/arm64/Postman.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString
