Description: Downloads both Arm and Intel verions of the Postman app, and packages them into a universal installer
Identifier: com.mhrono.recipes.pkg.Postman-Universal
ParentRecipe: com.mhrono.recipes.download.Postman-Universal
MinimumVersion: '2.3'

Input:
  NAME: Postman
  APP_BUNDLE_ID: com.postmanlabs.mac

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/Universal'
      pkgdirs:
        pkgroot: '0775'
        Scripts: '0775'

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/arm64/Postman.app'
      pkg_path: '%RECIPE_CACHE_DIR%/Universal/Scripts/%NAME%-arm64-%version%.pkg'

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/Postman.app'
      pkg_path: '%RECIPE_CACHE_DIR%/Universal/Scripts/%NAME%-x86_64-%version%.pkg'

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/Universal/Scripts/preinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash

        arm64_package="%NAME%-arm64-%version%.pkg"
        x86_64_package="%NAME%-x86_64-%version%.pkg"

        if [[ $( /usr/bin/arch ) = arm64* ]]; then
          /usr/sbin/installer -pkg "$arm64_package" -target "$3"
        else
          /usr/sbin/installer -pkg "$x86_64_package" -target "$3"
        fi

        exit 0

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/PackageInfoTemplate'
      file_content: |
        <pkg-info format-version="2" identifier="%APP_BUNDLE_ID%" install-location="/" auth="root">
        </pkg-info>

  - Processor: PkgInfoCreator
    Arguments:
      infofile: '%RECIPE_CACHE_DIR%/PackageInfo'
      pkgtype: 'flat'
      version: '%version%'
      template_path: '%RECIPE_CACHE_DIR%/PackageInfoTemplate'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        infofile: '%RECIPE_CACHE_DIR%/PackageInfo'
        id: '%APP_BUNDLE_ID%'
        version: '%version%'
        options: purge_ds_store
        pkgname: '%NAME%-Universal-%version%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        scripts: '%RECIPE_CACHE_DIR%/Universal/Scripts'
        pkgroot: '%RECIPE_CACHE_DIR%/Universal/pkgroot'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/Universal'
        - '%RECIPE_CACHE_DIR%/unpack'
