Description: Downloads the latest version of Keka.
Identifier: com.mhrono.recipes.download.Keka
MinimumVersion: '2.3'

Input:
  NAME: Keka
  GITHUB_REPO: aonez/Keka

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*\.dmg
    github_repo: '%GITHUB_REPO%'

- Processor: URLDownloaderPython
  Arguments:
    filename: '%NAME%-%version%.dmg'
    url: '%url%'

- Processor: Versioner
  Arguments:
    input_plist_path: '%pkgroot%/Applications/iTerm.app/Contents/Info.plist'
    plist_version_key: 'CFBundleShortVersionString'

- Processor: EndOfCheckPhase
