Description: Downloads the latest version of Yubikey Manager and creates a package.
Identifier: com.mhrono.recipes.pkg.yubikeymanager
ParentRecipe: com.github.apfelwerk.download.yubikey_manager
MinimumVersion: '2.3'

Input:
  NAME: "YubiKey Manager"
  SOFTWARE_TITLE: "YubiKey Manager"

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'