Description: Downloads latest VLC disk image and builds a package.
Identifier: com.github.autopkg.pkg.VLC
ParentRecipe: com.github.autopkg.download.VLC
MinimumVersion: 0.2.0

Input:
  NAME: VLC

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/VLC.app'
    source_path: '%pathname%/VLC.app'

- Processor: PkgInfoCreator
  Arguments:
    infofile: '%RECIPE_CACHE_DIR%/PackageInfo'
    pkgtype: flat
    template_path: PackageInfoTemplate

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: org.videolan.vlc.pkg
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
      resources: Resources
