Description: Downloads latest VLC disk image and builds a package.
Identifier: com.mhrono.recipes.pkg.VLC
ParentRecipe: com.mhrono.recipes.download.VLC
MinimumVersion: '2.3'

Input:
  NAME: VLC

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%pathname%'

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/VLC.app'
      source_path: '%pathname%/VLC.app'

  - Processor: PkgInfoCreator
    Arguments:
      infofile: '%RECIPE_CACHE_DIR%/PackageInfo'
      pkgtype: flat
      template_path: PackageInfoTemplate

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
        - group: admin
          path: Applications
          user: root
        id: '%APP_BUNDLE_ID%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'
        resources: Resources
