Description: Downloads the latest version of StrongDM.
Identifier: com.mhrono.recipes.download.strongdm
MinimumVersion: '2.3'

Input:
  NAME: StrongDM
  SOFTWARE_TITLE: SDM
  URL: 'https://app.strongdm.com/downloads/client/darwin/public'

Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: '%URL%'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/%SOFTWARE_TITLE%.app'
      requirement: 'identifier "com.electron.sdm" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = W5HSYBBJGA'
      deep_verification: true
      strict_verification: true

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%pathname%'