Description: Downloads the latest version of StrongDM and makes a pkg.
Identifier: com.mhrono.recipes.pkg.strongdm
MinimumVersion: "2.3"
ParentRecipe: com.mhrono.recipes.download.strongdm

Input:
  NAME: StrongDM

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/tmp'
      pkgdirs:
        scripts: '0775'

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/payload'
      pkgdirs:
        Applications: '0775'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/%SOFTWARE_TITLE%.app'
      source_path: '%pathname%/%SOFTWARE_TITLE%.app'
      overwrite: True

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/tmp/scripts/postinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash

        if [[ /usr/local/bin/sdm ]]; then
          rm /usr/local/bin/sdm
        fi

        ln -s /Applications/SDM.app/Contents/Resources/sdm.darwin /usr/local/bin/sdm

        chown root:wheel /usr/local/bin/sdm
        chmod +x /usr/local/bin/sdm

        exit 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        options: purge_ds_store
        id: '%bundleid%'
        version: '%version%'
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/payload'
        scripts: '%RECIPE_CACHE_DIR%/tmp/scripts'
        chown:
          - path: 'Applications'
            user: 'root'
            group: 'admin'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'
        - '%RECIPE_CACHE_DIR%/tmp'