Description: Downloads the latest version of Rectangle and creates a package.
Identifier: com.mhrono.recipes.pkg.Rectangle
ParentRecipe: com.mhrono.recipes.download.Rectangle
MinimumVersion: '2.3'

Input:
  NAME: Rectangle
  BUNDLE_ID: com.knollsoft.Rectangle

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Rectangle.app'
    source_path: '%pathname%/Rectangle.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%APP_BUNDLE_ID%'
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
