Comment: Created with Recipe Robot v1.0.1 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Grammarly.
Identifier: com.mhrono.recipes.download.Grammarly
MinimumVersion: '2.3'

Input:
  NAME: Grammarly

Process:
- Processor: SparkleUpdateInfoProvider
  Arguments:
    appcast_url: https://download-mac.grammarly.com/appcast.xml

- Processor: URLDownloaderPython
  Arguments:
    filename: '%NAME%-%version%.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Grammarly Installer.app'
    requirement: anchor apple generic and identifier "com.grammarly.ProjectLlama" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = W8F64X92K3)

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Grammarly Installer.app/Contents/Info.plist'
    plist_version_key: CFBundleVersion
