Description: Downloads the latest version of Tuple.
Identifier: com.mhrono.recipes.download.tuple
MinimumVersion: '2.3'

Input:
  NAME: Tuple
  SOFTWARE_TITLE: Tuple

Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://production.tuple.app/downloads/latest'
      filename: tuple.zip

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
      purge_destination: True

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/Tuple.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/%NAME%/Tuple.app'
      requirement: 'anchor apple generic and identifier "app.tuple.app" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = DQYU7DR9Q7)'