Description: Downloads the latest versions (ARM and INTEL) of Superpowered.
Identifier: com.mhrono.recipes.download.superpowered-universal
MinimumVersion: '2.3'

Input:
  NAME: Superpowered
  SOFTWARE_TITLE: Superpowered

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: 'https://download.todesktop.com/2203083ko7eiitd/td-latest-mac.json'
      request_headers:
        Host: 'download.todesktop.com'
        user-agent: 'Install%20Superpowered/1 CFNetwork/1399.4 Darwin/22.1.0'
      re_pattern: 'https:\/\/download\.todesktop\.com\/2203083ko7eiitd\/Superpowered%20\d\.\d{3,}\.\d+%20-%20Build%20\d{6}\w+-x64\.dmg'
      result_output_var_name: 'url_x64'

  - Processor: URLTextSearcher
    Arguments:
      url: 'https://download.todesktop.com/2203083ko7eiitd/td-latest-mac.json'
      request_headers:
        Host: 'download.todesktop.com'
        user-agent: 'Install%20Superpowered/1 CFNetwork/1399.4 Darwin/22.1.0'
      re_pattern: 'https:\/\/download\.todesktop\.com\/2203083ko7eiitd\/Superpowered%20\d\.\d{3,}\.\d+%20-%20Build%20\d{6}\w+-arm64\.dmg'
      result_output_var_name: 'url_arm64'

  - Processor: URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%-arm64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%url_arm64%'
      request_headers:
        Host: 'download.todesktop.com'
        user-agent: 'Install%20Superpowered/1 CFNetwork/1399.4 Darwin/22.1.0'

  - Processor: URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%-x86_64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%url_x64%'
      request_headers:
        Host: 'download.todesktop.com'
        user-agent: 'Install%20Superpowered/1 CFNetwork/1399.4 Darwin/22.1.0'

  - Processor: EndOfCheckPhase

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-arm64.dmg/%NAME%.app'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/arm64/%NAME%.app'
      overwrite: true

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-x86_64.dmg/%NAME%.app'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/%NAME%.app'
      overwrite: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/arm64/%NAME%.app'
      requirement: 'identifier "com.superpowered.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = AS7VEXXF8M'
      deep_verification: true
      strict_verification: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/%NAME%.app'
      requirement: 'identifier "com.superpowered.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = AS7VEXXF8M'
      deep_verification: true
      strict_verification: true

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/arm64/%NAME%.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString