Description: Downloads the latest version of Adobe Acrobat Pro and creates a package. Thanks to @mosen and @timsutton for the original versions of these recipes.
Identifier: com.mhrono.recipes.pkg.acrobatpro
ParentRecipe: com.mhrono.recipes.download.acrobatpro
MinimumVersion: '2.3'

Input:
  NAME: "AdobeAcrobatPro"
  SERIAL_NUMBER: ''
  FEATURE_LOCKDOWN_PLIST:
    DC:
      FeatureLockdown:
        bUpdater: false

Process:
  - Processor: URLDownloader
    Arguments:
      url: 'http://ardownload.adobe.com/pub/adobe/acrobat/mac/AcrobatDC/misc/AdobeCustomizationWizard1500720033_DC.dmg'
      request_headers:
        User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36'
      download_dir: '%RECIPE_CACHE_DIR%/custwiz'
      filename: 'custwiz.dmg'
  
  - Processor: AcrobatProCustomizationWizardRunner
    Arguments:
      acrobat_pkg_path: '%RECIPE_CACHE_DIR%/downloads/Acrobat_%MAJOR_VERSION%_Web_WWMUI.dmg/Acrobat/Acrobat %MAJOR_VERSION% Installer.pkg'
      wizard_dmg_path: '%RECIPE_CACHE_DIR%/custwiz/custwiz.dmg/Acrobat Customization Wizard DC.app'
      output_pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
      serial_number: '%SERIAL_NUMBER%'