Description: Downloads the current release version of Zoom and builds a package.
Identifier: com.mhrono.recipes.pkg.Zoom
ParentRecipe: com.mhrono.recipes.download.zoomus
MinimumVersion: '2.3'

Input:
  NAME: Zoom
  BUNDLE_ID: us.zoom.xos

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/expanded'
      flat_pkg_path: '%pathname%'

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications'
      pkg_payload_path: '%RECIPE_CACHE_DIR%/expanded/zoomus.pkg/Payload'

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/zoom.us.app/Contents/Info.plist'
      plist_keys:
        CFBundleShortVersionString: jamfversion
        CFBundleVersion: version
        LSMinimumSystemVersion: min_os_version

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/zoom.us.app/Contents/Info.plist'
      plist_version_key: CFBundleVersion

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
        - group: admin
          path: Applications
          user: root
        id: '%APP_BUNDLE_ID%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        scripts: scripts
        version: '%version%'

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%RECIPE_CACHE_DIR%/expanded'
