Description: This recipe does not behave like standard jamf recipes. After downloading and packaging the app, multiple smart groups and policies are created or updated. This recipe is intended for use with the Auto-Update workflow available at https://github.com/mhrono/Auto-Update.
Identifier: com.mhrono.recipes.jamf.notion
MinimumVersion: "2.3"
ParentRecipe: com.github.moofit-recipes.pkg.NotionUniversal

Input:
  NAME: Notion
  APP_BUNDLE_ID: "notion.id"
  CATEGORY: Collaboration
  TRIGGER_NAME: "autoupdate-%NAME%"
  DEFER_TRIGGER: "defer-%NAME%"
  DEFER_LIMIT: "10"
  FORCE_UPDATE: "False"
  ROLLBACK: "False"
  TEST_FLAG: ""
  SELF_SERVICE_DESCRIPTION: "More than a doc. Or a table. Customize Notion to work the way you do."
  SELF_SERVICE_ICON: Notion.png
  UPDATE_PREDICATE: "pkg_uploaded == False"
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"
  
Process:

  - Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer
  
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOP_PREDICATE%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "AutoPkg"

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.recipes.commonprocessors/PkgInfoReader
    Arguments:
      source_pkg: "%pkg_path%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "SmartGroupTemplate-autopatch-regex%TEST_FLAG%.xml"
      computergroup_name: "autoupdate-%NAME%%TEST_FLAG%"
      replace_group: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "SmartGroupTemplate-notinstalled.xml"
      computergroup_name: "App Not Installed: %NAME%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "SmartGroupTemplate-installed.xml"
      computergroup_name: "App Installed: %NAME%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-autopatch.xml"
      policy_name: "Install Latest %NAME%%TEST_FLAG%"
      frequency: "Ongoing"
      checkin_bool: "false"
      trigger_name: "%TRIGGER_NAME%"
      policy_category: "AutoPkg"
      group_name: "autoupdate-%NAME%%TEST_FLAG%"
      self_service_bool: "false"
      self_service_action: "Install"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-selfservice-install.xml"
      policy_name: "Install %NAME%"
      frequency: "Ongoing"
      checkin_bool: "false"
      policy_category: "%CATEGORY%"
      group_name: "App Not Installed: %NAME%"
      self_service_bool: "true"
      self_service_action: "Install"
      icon: "%SELF_SERVICE_ICON%"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-selfservice-update.xml"
      policy_name: "Update %NAME%"
      script_trigger_name: "%TRIGGER_NAME%"
      frequency: "Ongoing"
      checkin_bool: "false"
      policy_category: "Updates"
      group_name: "autoupdate-%NAME%%TEST_FLAG%"
      self_service_bool: "true"
      self_service_action: "Update to"
      icon: "%SELF_SERVICE_ICON%"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-selfservice-reinstall.xml"
      policy_name: "Re-Install %NAME%"
      frequency: "Ongoing"
      checkin_bool: "false"
      policy_category: "%CATEGORY%"
      group_name: "App Installed: %NAME%"
      exclude_group_name: "autoupdate-%NAME%%TEST_FLAG%"
      self_service_bool: "true"
      self_service_action: "Re-Install"
      icon: "%SELF_SERVICE_ICON%"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-prompt.xml"
      policy_name: "Monthly Prompt: %NAME%%TEST_FLAG%"
      script_trigger_name: "%TRIGGER_NAME%"
      policy_category: "Auto-Update: Monthly Prompt"
      group_name: "autoupdate-%NAME%%TEST_FLAG%"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-defer.xml"
      policy_name: "Deferred Update: %NAME%%TEST_FLAG%"
      script_trigger_name: "%TRIGGER_NAME%"
      policy_category: "Auto-Update: Deferral Policies"
      group_name: "autoupdate-%NAME%%TEST_FLAG%"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-silent.xml"
      policy_name: "Silent Update: %NAME%%TEST_FLAG%"
      group_name: "autoupdate-%NAME%%TEST_FLAG%"
      script_trigger_name: "%TRIGGER_NAME%"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
    Arguments:
      profile_name: "App Update Data: %NAME%"
      identifier: "com.appUpdates.managedApps.%NAME%"
      organization: "AutoPkg"
      payload: "payloadTemplate.plist"
      profile_template: "ConfigProfileTemplate-autopatch.xml"
      profile_category: "AutoPkg"
      replace_profile: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner