Description: Downloads the current release version of Alfred 5 and creates a package.
Identifier: com.mhrono.recipes.pkg.alfred5
MinimumVersion: "2.3"
ParentRecipe: com.mhrono.recipes.download.alfred5

Input:
  NAME: "Alfred 5"

Process:
  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/unpack/%NAME%.app/Contents/Info.plist"
      plist_version_key: "CFBundleShortVersionString"

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/payload"
      pkgdirs:
        Applications: '0775'

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/unpack"
      destination_path: "%RECIPE_CACHE_DIR%/payload/Applications"
      overwrite: True

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        options: "purge_ds_store"
        id: '%APP_BUNDLE_ID%'
        chown:
          - path: "Applications"
            user: "root"
            group: "admin"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/payload"