Description: Downloads the latest Alfred 5.
Identifier: com.mhrono.recipes.download.alfred5
MinimumVersion: "2.3"

Input:
  NAME: "Alfred 5"
  URL: "https://www.alfredapp.com/app/update5/general.xml"

Process:

  - Processor: URLDownloader
    Arguments:
      url: "%URL%"
      filename: "metadata.plist"

  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/downloads/metadata.plist"
      plist_keys:
        location: "archive_url"

  - Processor: URLDownloaderPython
    Arguments:
      url: "%archive_url%"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.tar.gz"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%"
      purge_destination: True

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%/Alfred 5.app"
      requirement: anchor apple generic and identifier "com.runningwithcrayons.Alfred" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XZZXE9SED4)
      strict_verification: True