Description: Downloads the latest version of Island.
Identifier: com.mhrono.recipes.download.island
MinimumVersion: '2.3'

Input:
  NAME: Island
  URL: ''

Process:
  - Processor: URLDownloaderPython
    Arguments:
      filename: '%NAME%.pkg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL%'

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      flat_pkg_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg'
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack/payload'
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%.pkg/Payload'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/payload/%NAME%.app'
      requirement: 'identifier "io.island.Island" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */'
      deep_verification: true
      strict_verification: true

  - Processor: EndOfCheckPhase