Description: Downloads the latest version of Island and creates a package.
Identifier: com.mhrono.recipes.pkg.island
ParentRecipe: com.mhrono.recipes.download.island
MinimumVersion: '2.3'

Input:
  NAME: Island

Process:
  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/payload/%NAME%.app/Contents/Info.plist'
      plist_version_key: 'CFBundleShortVersionString'

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
      source_pkg: '%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'