Description: Downloads the latest version of Island and creates a package.
Identifier: com.mhrono.recipes.pkg.island
ParentRecipe: com.mhrono.recipes.download.island
MinimumVersion: '2.3'

Input:
  NAME: Island

Process:

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%.app'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'