Description: Downloads the latest version of StrongDM CLI.
Identifier: com.mhrono.recipes.download.strongdmcli
MinimumVersion: '2.3'

Input:
  NAME: StrongDM CLI

Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://app.strongdm.com/releases/cli/darwin/latest'
      prefetch_filename: True

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      purge_destination: True

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/%NAME%/sdm'
      requirement: 'identifier "sdm.darwin" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = W5HSYBBJGA'
      deep_verification: true
      strict_verification: true

  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      text_in: '%pathname%'
      result_output_var_name: 'version'
      re_pattern: '_([\d.]+)_'