Description: Downloads the latest version of AWSCLIV2 and creates a package.
Identifier: com.mhrono.recipes.pkg.awscliv2
ParentRecipe: com.mhrono.recipes.download.awscliv2
MinimumVersion: '2.3'

Input:
  NAME: AWSCLI

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/aws-cli.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/unpack/payload"

  - Processor: com.github.nmcspadden.shared/PackageInfoVersioner
    Arguments:
      package_info_path: "%RECIPE_CACHE_DIR%/unpack/aws-cli.pkg/PackageInfo"

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'