Description: Downloads the latest version of AWSCLIV2 and creates a package.
Identifier: com.mhrono.recipes.pkg.awscliv2
ParentRecipe: com.mhrono.recipes.download.awscliv2
MinimumVersion: '2.3'

Input:
  NAME: AWSCLI

Process:

  - Processor: PkgExtractor
    Arguments:
      pkg_path: "%pathname%"
      extract_root: "%RECIPE_CACHE_DIR%/unpack"

  - Processor: com.github.apizz.apizz-recipes.SharedProcessors/ExecutableFileVersioner
    Arguments:
      found_filename: "%RECIPE_CACHE_DIR%/unpack/usr/local/aws-cli/aws"
      interpreter_path: "/bin/zsh"
      version_argument: "--version"

  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      re_pattern: (?<=\/).*?(?=\s)
      text_in: "%version%"
      result_output_var_name: "version"

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'