Description: Downloads the current release version of Sequel Pro and builds a package.
Identifier: com.mhrono.recipes.pkg.SequelPro
ParentRecipe: com.mhrono.recipes.download.SequelPro
MinimumVersion: '2.3'

Input:
  NAME: Sequel Pro

Process:
- Processor: DeprecationWarning
  Arguments:
    warning_message: 'Sequel Pro is no longer under active development (details: https://github.com/sequelpro/sequelpro/issues/3705). This recipe may be removed in the future.'

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Sequel Pro.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString

- Processor: AppPkgCreator
