Description: Download Okta Verify and copy to versioned package.
Identifier: com.mhrono.recipes.pkg.OktaVerify
ParentRecipe: com.mhrono.recipes.download.OktaVerify
MinimumVersion: '2.3'

Input:
  NAME: OktaVerify

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/payload/Applications'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Payload'

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/payload/Applications/Okta Verify.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/OktaVerify-%version%.pkg'
    source_pkg: '%pathname%'
