Description: Downloads the latest CloudFlare Warp for Mac
Identifier: com.mhrono.recipes.download.CloudFlareWarp
MinimumVersion: '2.3'

Input:
  NAME: Cloudflare WARP

Process:

  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: 'https://api.appcenter.ms/v0.1/public/sparkle/apps/87d9992a-351c-44a9-849b-3f9a89d63d18'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderRequests
    Arguments:
      filename: '%NAME%.pkg'
      url: '%url%'

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      flat_pkg_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg'
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack/payload'
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Cloudflare_WARP.pkg/Payload'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/payload/Cloudflare WARP.app'
      requirement: anchor apple generic and identifier "com.cloudflare.1dot1dot1dot1.macos" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "68WVV388M8")
      strict_verification: true

  - Processor: EndOfCheckPhase
