Description: Downloads the latest CloudFlare Warp for Mac
Identifier: com.mhrono.recipes.download.CloudFlareWarp
MinimumVersion: '2.3'

Input:
  NAME: CloudFlareWarp

Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderRequests
    Arguments:
      filename: '%NAME%.zip'
      url: https://1111-releases.cloudflareclient.com/mac/Cloudflare_WARP.zip
      User_Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36'

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unzip'
      purge_destination: true

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      flat_pkg_path: '%RECIPE_CACHE_DIR%/unzip/Cloudflare_WARP.pkg'
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack/payload'
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Cloudflare_WARP.pkg/Payload'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/payload/Cloudflare WARP.app'
      requirement: anchor apple generic and identifier "com.cloudflare.1dot1dot1dot1.macos" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "68WVV388M8")
      strict_verification: true

  - Processor: EndOfCheckPhase
