Description: Downloads the current release version of PyCharm (Professional) and converts it into a pkg.
Identifier: com.mhrono.recipes.pkg.PyCharm
ParentRecipe: com.mhrono.recipes.download.PyCharmPro
MinimumVersion: "2.3"

Input:
  NAME: PyCharm

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/PyCharm.app'
      source_path: '%pathname%/PyCharm.app'

  - Processor: Versioner
    Comment: Get version from the app
    Arguments:
      input_plist_path: '%pkgroot%/Applications/PyCharm.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
        - group: admin
          path: Applications
          user: root
        id: '%APP_BUNDLE_ID%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        version: '%version%'
