Description: Downloads the latest release of Firefox
Identifier: com.mhrono.recipes.download.firefox
MinimumVersion: '2.3'

Input:
  NAME: Firefox

Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://download.mozilla.org/?product=firefox-latest&os=osx&lang=en-US'
      filename: '%NAME%.dmg'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      comment: Use wildcard matching for the app so it will also match FirefoxDeveloperEdition.app and FirefoxNightly.app
      input_path: '%pathname%/Firefox*.app'
      requirement: anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "43AQ936H96"
