Description: Downloads Firefox disk image and builds a package.
Identifier: com.mhrono.recipes.pkg.Firefox_EN
ParentRecipe: com.mhrono.recipes.download.firefox-rc-en_US
MinimumVersion: '2.3'

Input:
  NAME: Firefox

Process:
- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Firefox.app/Contents/Info.plist'
    plist_version_key: 'CFBundleShortVersionString'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Firefox.app'
    source_path: '%pathname%/Firefox.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: org.mozilla.firefox.pkg
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
