<policy>
    <!-- General - Name, Enabled/Disabled, Triggers, Frequency, Categories -->
    <general>
        <name>%policy_name%</name>
        <enabled>true</enabled>
        <frequency>%frequency%</frequency>
        <trigger>EVENT</trigger>
        <trigger_checkin>%checkin_bool%</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other>%trigger_name%</trigger_other>
        <category>
            <name>%policy_category%</name>
        </category>
    </general>
    <!-- Scope -->
    <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>%group_name%</name>
            </computer_group>
        </computer_groups>
        <exclusions/>
    </scope>
    <!-- Packages -->
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <!-- Scripts -->
    <scripts>
        <size>0</size>
    </scripts>
    <!-- Self Service details -->
    <self_service>
        <use_for_self_service>%self_service_bool%</use_for_self_service>
        <install_button_text>%self_service_action% %version%</install_button_text>
        <reinstall_button_text>%self_service_action% %version%</reinstall_button_text>
        <self_service_display_name>%policy_name%</self_service_display_name>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
        <self_service_categories>
            <category>
                <name>%policy_category%</name>
                <display_in>true</display_in>
                <feature_in>false</feature_in>
            </category>
        </self_service_categories>
    </self_service>
    <!-- Maintenance e.g. recon -->
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <!-- Files and processes e.g. run command -->
    <files_processes/>
    <!-- User interaction e.g. start and finish messages -->
    <user_interaction>
        <message_start/>
        <message_finish/>
    </user_interaction>
</policy>
