<policy>
    <!-- General - Name, Enabled/Disabled, Triggers, Frequency, Categories -->
    <general>
        <name>%policy_name%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <category>
            <name>%policy_category%</name>
        </category>
    </general>
    <!-- Scope -->
    <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>%group_name%</name>
            </computer_group>
        </computer_groups>
        <exclusions/>
    </scope>
    <!-- Packages -->
    <package_configuration/>
    <!-- Scripts -->
    <scripts>
        <size>1</size>
        <script>
            <name>Auto-Update: App Quitter</name>
            <priority>Before</priority>
            <parameter4>%APP_BUNDLE_ID%</parameter4>
            <parameter5>false</parameter5>
            <parameter6>%NAME%</parameter6>
            <parameter7>%script_trigger_name%</parameter7>
            <parameter8>true</parameter8>
            <parameter9>%DEFER_TRIGGER%</parameter9>
            <parameter10>14</parameter10>
            <parameter11>%version%</parameter11>
        </script>
    </scripts>
    <!-- Self Service details -->
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>%self_service_action% %version%</install_button_text>
        <reinstall_button_text>%self_service_action% %version%</reinstall_button_text>
        <self_service_display_name>%NAME%</self_service_display_name>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <!-- Maintenance e.g. recon -->
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <!-- Files and processes e.g. run command -->
    <files_processes/>
    <!-- User interaction e.g. start and finish messages -->
    <user_interaction>
        <message_start/>
        <message_finish/>
    </user_interaction>
</policy>
