Description: Downloads the latest versions (ARM and INTEL) of Wireshark.
Identifier: com.mhrono.recipes.download.wireshark-universal
MinimumVersion: '2.3'

Input:
  NAME: Wireshark
  SOFTWARE_TITLE: Wireshark
  URL_ARM64: https://www.wireshark.org/download/osx/Wireshark%20Latest%20Arm%2064.dmg
  URL_X86_64: https://www.wireshark.org/download/osx/Wireshark%20Latest%20Intel%2064.dmg

Process:
  - Processor: URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%-arm64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_ARM64%'

  - Processor: URLDownloaderPython
    Arguments:
      filename: '%SOFTWARE_TITLE%-x86_64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_X86_64%'

  - Processor: EndOfCheckPhase

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-arm64.dmg/%NAME%.app'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/arm64/%NAME%.app'
      overwrite: true

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-x86_64.dmg/%NAME%.app'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/%NAME%.app'
      overwrite: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/arm64/%NAME%.app'
      requirement: 'identifier "org.wireshark.Wireshark" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7Z6EMTD2C6"'
      deep_verification: true
      strict_verification: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/%NAME%.app'
      requirement: 'identifier "org.wireshark.Wireshark" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7Z6EMTD2C6"'
      deep_verification: true
      strict_verification: true

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/arm64/%NAME%.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString