Description: Downloads latest Google Chrome disk image.
Identifier: com.mhrono.recipes.download.googlechrome
MinimumVersion: '2.3'

Input:
  NAME: GoogleChrome
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg

Process:
- Processor: URLDownloaderPython
  Arguments:
    filename: '%NAME%.dmg'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Google Chrome.app'
    requirement: (identifier "com.google.Chrome" or identifier "com.google.Chrome.beta" or identifier "com.google.Chrome.dev" or identifier "com.google.Chrome.canary") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV
    strict_verification: false
