Description: Downloads latest Google Chrome disk image and builds a package.
Identifier: com.mhrono.recipes.pkg.googlechrome
ParentRecipe: com.mhrono.recipes.download.googlechrome

Input:
  NAME: GoogleChrome

Process:
  - Processor: Versioner
    Arguments:
      input_plist_path: '%pathname%/Google Chrome.app/Contents/Info.plist'
      plist_version_key: 'CFBundleShortVersionString'

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/Google Chrome.app'
      source_path: '%pathname%/Google Chrome.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
        - group: admin
          path: Applications
          user: root
        id: '%APP_BUNDLE_ID%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        version: '%version%'
