Description: Downloads the latest versions (ARM and INTEL) of 1Password.
Identifier: com.mhrono.recipes.download.1password-universal
MinimumVersion: '2.3'

Input:
  NAME: 1Password
  SOFTWARE_TITLE: 1Password
  URL_ARM64: https://downloads.1password.com/mac/1Password-latest-aarch64.zip
  URL_X86_64: https://downloads.1password.com/mac/1Password-latest-x86_64.zip

Process:
  - Processor: URLDownloader
    Arguments:
      filename: '%SOFTWARE_TITLE%-arm64.zip'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_ARM64%'

  - Processor: URLDownloader
    Arguments:
      filename: '%SOFTWARE_TITLE%-x86_64.zip'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_X86_64%'

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-arm64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/arm64'
      purge_destination: true

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-x86_64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/x86_64'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/arm64/%NAME%.app'
      requirement: 'identifier "com.1password.1password" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2BUA8C4S2C"'
      deep_verification: true
      strict_verification: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/%NAME%.app'
      requirement: 'identifier "com.1password.1password" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2BUA8C4S2C"'
      deep_verification: true
      strict_verification: true

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/arm64/%NAME%.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString