Description: Downloads the current release version of 1Password 8 and copies the downloaded package.
Identifier: com.mhrono.recipes.pkg.1password8
MinimumVersion: "2.3"
ParentRecipe: com.mhrono.recipes.download.1password8

Input:
  NAME: "1Password"

Process:

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/Applications/1Password.app/Contents/Info.plist"
      plist_version_key: "CFBundleShortVersionString"

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/Applications"