Description: Downloads the current release version of 1Password 8.
Identifier: com.mhrono.recipes.download.1password8
MinimumVersion: "2.3"

Input:
  NAME: "1Password"

Process:
  - Processor: URLDownloaderPython
    Arguments:
      url: "https://downloads.1password.com/mac/1Password.pkg"
      filename: "1Password.pkg"

  - Processor: EndOfCheckPhase

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/com.1Password.1Password.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/Applications"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/Applications/1Password.app"
      requirement: identifier "com.1password.1password" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2BUA8C4S2C"
      strict_verification: True