Description: Downloads the current release version of iTerm 2 and makes a package.
Identifier: com.mhrono.recipes.pkg.iTerm2
ParentRecipe: com.mhrono.recipes.download.iTerm2
MinimumVersion: '2.3'

Input:
  NAME: iTerm2

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-pkg'

  - Processor: Copier
    Arguments:
      destination_path: '%pkgroot%/Applications/'
      overwrite: true
      source_path: '%RECIPE_CACHE_DIR%/%NAME%/'

  - Processor: PlistReader
    Arguments:
      info_path: '%pkgroot%/Applications/iTerm.app'
      plist_keys:
        CFBundleIdentifier: bundleid
        CFBundleName: app_name
        CFBundleShortVersionString: version
        LSMinimumSystemVersion: min_os_version

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
        - group: admin
          path: Applications
          user: root
        id: '%APP_BUNDLE_ID%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'
