Description: Downloads the latest Microsoft Office 365 Suite SKU-less installer package.
Identifier: com.mhrono.recipes.download.MicrosoftOffice365Suite
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Office 365 Suite
  VENDOR: Microsoft
  SOFTWARETITLE1: Office
  SOFTWARETITLE2: Suite
  ID: '525133'
  DOWNLOAD_URL_BASE: https://go.microsoft.com/fwlink/?linkid=

Process:
  - Processor: OfficeSuiteSKULessVersionProvider

  - Processor: URLDownloaderPython
    Arguments:
      filename: '%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_%version%.pkg'
      url: '%DOWNLOAD_URL_BASE%%ID%'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
      - 'Developer ID Installer: Microsoft Corporation (UBF8T346G9)'
      - Developer ID Certification Authority
      - Apple Root CA
      input_path: '%pathname%'
