Description: Downloads the latest Microsoft Excel installer package for Office 365.
Identifier: com.mhrono.recipes.download.microsoftexcel365
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Excel
  VENDOR: Microsoft
  SOFTWARETITLE: Excel
  PRODUCTID: '525135'
  DOWNLOADURL: https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%

Process:
- Processor: URLDownloaderPython
  Arguments:
    filename: '%VENDOR%_%SOFTWARETITLE%.pkg'
    url: '%DOWNLOADURL%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Microsoft Corporation (UBF8T346G9)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
