Description: Downloads the latest version of Microsoft's Remote Desktop installer package and renames the package.
Identifier: com.mhrono.recipes.pkg.microsoftremotedesktop
ParentRecipe: com.mhrono.recipes.download.microsoftremotedesktop
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Remote Desktop
  VENDOR: Microsoft
  SOFTWARETITLE: Remote
  SOFTWARETYPE: Desktop
  VERSIONTYPE: CFBundleShortVersionString

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/unpack'
      flat_pkg_path: '%pathname%'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/downloads/unpack/*rdc*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/downloads/payload'
      pkg_payload_path: '%found_filename%/Payload'

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/downloads/payload/Microsoft Remote Desktop.app/Contents/Info.plist'
      plist_version_key: '%VERSIONTYPE%'

  - Processor: PkgCopier
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%SOFTWARETYPE%_%version%.pkg'
      source_pkg: '%pathname%'

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%RECIPE_CACHE_DIR%/downloads/unpack'
      - '%RECIPE_CACHE_DIR%/downloads/payload'
